{
  "tugoz-co-op": {
    "logo": {
      "path": "images/work/tugoz.svg",
      "width": 75,
      "height": 75
    },
    "heading": "Tugoz LLC",
    "workRole": "Software Engineering Co-op",
    "description":[
      "Created testing and production environment for Flutter applications, integrating Firebase Test Lab and AWS Device Farm",
      "Implemented CI/CD pipelines for automated building, testing, and publishing of Flutter apps to Play Store and App Store",
      "Built test suites using Dart and Mockito, conducted physical and simulated tests, achieving over 90% code coverage"
    ],
    "startDate": "August 2025",
    "endDate": "December 2025"
  },
  "tugoz": {
    "logo": {
      "path": "images/work/tugoz.svg",
      "width": 75,
      "height": 75
    },
    "heading": "Tugoz LLC",
    "workRole": "Software Engineering Intern",
    "description":[
      "Independently developed a Flutter app for their web-based event management platform, Tugoz, owning the entire project development cycle from ideation to deployment on app stores",
      "Developed software architecture for the Flutter app, including corresponding backend architecture, supporting dynamic event maps, event scheduling, user management, and real-time notifications",
      "Published the app on Google Play Store and Apple App Store",
      "Collaborated with backend teams and stakeholders to define data models, API contracts, and integration strategies",
      "Designed RESTful API endpoints to support user authentication, real-time push notifications, and event data retrieval"
    ],
    "startDate": "June 2025",
    "endDate": "August 2025"
  },
  "widewings": {
    "logo": {
      "path": "images/work/wide-wings-logo.png",
      "alt": "Wide Wings Media",
      "width": 75,
      "height": 54,
      "id": "wide-wings-logo",
      "classList": "dark-theme-invert"
    },
    "heading": "Wide Wings Media",
    "workRole": "Fullstack Developer, DevOps, UI/UX",
    "description": [
      "Fully redesigned and replaced the existing website for <a href=\\\"https://ticketkhidakee.com\\\" target=\\\"_blank\\\" class=\\\"a\\\">ticketkhidakee.com</a>, replacing the existing LAMP stack with a Django-Postgres stack, leading to a ∼100% increase in new user traffic and ∼30% increase in user retention over 6 months",
      "Designed a robust cloud architecture on AWS, maintaining P95 latency below 100ms with ∼10,000 concurrent users",
      "Configured global CDN on AWS CloudFront and designed a caching policy successfully handling ∼500,000 daily users"
    ],
    "startDate": "July 2023",
    "endDate": "June 2024"
  },
  "mastercard": {
    "logo": {
      "path": "images/work/mastercard.png",
      "alt": "Mastercard",
      "width": 75,
      "height": 60
    },
    "heading": "MasterCard",
    "workRole": "Software Development Intern",
    "description": [
      "Wrote a serde protocol to translate between protocol buffers and AVRO-based schemas for event-driven applications",
      "Facilitated communication between heterogenous serialization format apps, reducing the data transformation delay by ∼15%",
      "Wrote a proof-of-concept Spring application for the implemented protocol, hosted on the internal Mastercard repository"
    ],
    "startDate": "May 2023",
    "endDate": "July 2023"
  },
  "coepidealabs": {
    "logo": {
      "path": "images/education/coep.png",
      "alt": "COEP Idea Labs",
      "width": 65,
      "height": 75,
      "classList": "dark-theme-invert"
    },
    "heading": "Student Researcher, COEP IDEA Labs",
    "workRole": "Data Acquisition & Robotics Team",
    "description": [
      "Worked in an interdisciplinary team to build data acquisition robots for collecting leaf and soil data for soyabean plants in Indian farms.",
      "Designed a rover-like robot to be driven between rows of crops, and a hand-held device to capture data for farms too dense for the rover."
    ],
    "startDate": "September 2022",
    "endDate": "February 2023"
  },
  "coepweb": {
    "logo": {
      "path": "images/education/coep.png",
      "alt": "College of Engineering, Pune Webteam",
      "width": 65,
      "height": 75,
      "id": "coep-webteam-logo",
      "classList": "dark-theme-invert"
    },
    "heading": "COEP Webteam",
    "workRole": "Student Contributor",
    "description": [
      "Maintained the college website and its on-prem servers. Managed a Drupal based CMS and coordinated with various other clubs, faculty, and staff to keep the website up to date."
    ],
    "startDate": "February 2022",
    "endDate": "August 2022"
  }
}